// Function respon

//-- 
const wait = () => { 
  return '𝑃𝑙𝑒𝑎𝑠𝑒 𝑤𝑎𝑖𝑡.'
  }
  
  //--
  const stick = () => {
    return '𝐸𝑟𝑟𝑜𝑟. 𝑇𝑟𝑦 𝑎𝑔𝑎𝑖𝑛 𝑜𝑟 𝑔𝑖𝑣𝑒 𝑢𝑝.'
  }
  
  //--
  const err = (prefix) => {
    return '𝐸𝑟𝑟𝑜𝑟. 𝑇𝑟𝑦 𝑎𝑔𝑎𝑖𝑛 𝑜𝑟 𝑔𝑖𝑣𝑒 𝑢𝑝.'
  }
  
  //-- 
  const group = () => {
    return '𝑇ℎ𝑖𝑠 𝑐𝑜𝑚𝑚𝑎𝑛𝑑 𝑖𝑠 𝑜𝑛𝑙𝑦 𝑓𝑜𝑟 𝑔𝑟𝑜𝑢𝑝𝑠.'
  }
  
  //-- 
  const ban = () => {
    return '⌯   ﹝𝚈𝚘𝚞 𝚊𝚛𝚎 𝚋𝚊𝚗𝚎𝚍.﹞'
  }
  
  //--
  const ownerB = () => {
    return '𝑇ℎ𝑖𝑠 𝑐𝑜𝑚𝑚𝑎𝑛𝑑 𝑖𝑠 𝑜𝑛𝑙𝑦 𝑓𝑜𝑟 𝑡ℎ𝑒 𝑜𝑤𝑛𝑒𝑟.'
  }
  
  //--
  const userP = () => {
    return '⌯   ﹝You dont have a pet. Visit .petshop.﹞'
  }
  
  //--
  const premi = () => {
    return '𝑇ℎ𝑖𝑠 𝑐𝑜𝑚𝑚𝑎𝑛𝑑 𝑖𝑠 𝑜𝑛𝑙𝑦 𝑓𝑜𝑟 𝑡ℎ𝑒 𝑜𝑤𝑛𝑒𝑟.'
  }
  
  //--
  const userB = (prefix) => {
    return `𝑌𝑜𝑢 𝑎𝑟𝑒 𝑛𝑜𝑡 𝑟𝑒𝑔𝑖𝑠𝑡𝑒𝑟𝑒𝑑. 𝑃𝑙𝑒𝑎𝑠𝑒 𝑟𝑒𝑔𝑖𝑠𝑡𝑒𝑟 𝑣𝑖𝑎\n\n.register name`
  }
  
  //--
  const admin = () => {
    return '𝑇ℎ𝑖𝑠 𝑐𝑜𝑚𝑚𝑎𝑛𝑑 𝑖𝑠 𝑜𝑛𝑙𝑦 𝑓𝑜𝑟 𝑎𝑑𝑚𝑖𝑛𝑠.'
  }
  
  //--
  const Badmin = () => {
    return '⌯   ﹝𝙸 𝚗𝚎𝚎𝚍 𝚊𝚍𝚖𝚒𝚗 𝚏𝚘𝚛 𝚝𝚑𝚒𝚜 𝚝𝚘 𝚠𝚘𝚛𝚔.﹞'
  }
  
  
  module.exports =  { wait, stick, err, group, ban, ownerB, userP, premi, userB, admin, Badmin } 
  